; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:       Кирил Кирилов - DumpeR <dumperbg@abv.bg>
; 
;
; Translation Instructions:
;       Copy this file to a new file named after the new language
;               Eg: A language file for the German language would be named German.ini.
;       Replace the English words and phrases with their native equivalents,
;               attempting to match the English phrasing and case-sensitivity as
;               closely as possible for the sake of consistency
;       Update the Author and Homepage information at the top of your new language
;               file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;       E-mail new language files to jbreland@legroom.net for inclusion in main
;               Universal Extractor installer
;
;       The following symbols have special meanings:
;       & - when used in a GUI label or button, it precedes the letter that will
;               be registered as a "hotkey" for that function
;       %n - indicates a newline character, which will be replaced when displayed
;       %t - indicates a tab character, which will be replaced when displayed
;       %s - indicates a string variable that UniExtract will replace when displayed
;               The contents each %s variables is hardocded into UniExtract.
;               The order and number of %s variables is very important and should not
;               be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&ОК"
CANCEL_BUT = "От&каз"
MAIN_DEST_DIR_LABEL = "&Изходна папка:"
MAIN_FILE_LABEL = "&Архив/Пакет, за извличане:"
MENU_FILE_LABEL = "&Файл" 
MENU_FILE_QUIT_LABEL = "&Изход"	
MENU_EDIT_LABEL = "Р&едактиране"
MENU_EDIT_PREFS_LABEL = "&Настройки"
MENU_HELP_LABEL = "&Помощ"
MENU_HELP_WEB_LABEL = "&Сайта на %s"
PREFS_TITLE_LABEL = "Настройки"
PREFS_UNIEXTRACT_OPTS_LABEL = "Опции за Universal Extractor"
PREFS_HISTORY_LABEL = "Записвай &хронология"
PREFS_FORMAT_OPTS_LABEL = "Опции за файловете"
PREFS_LANG_LABEL = "&Език"
PREFS_DEBUG_LABEL = "&Записвай файл за грешки в:"
PREFS_WARN_EXECUTE_LABEL = "Уведомявай преди изпълнение"
PREFS_REMOVE_DUPE_LABEL = "Изтривай дублираните файлове"
PREFS_REMOVE_TEMP_LABEL = "Изтривай временните файлове"
PREFS_APPEND_EXT_LABEL = "Добавяй липсващи разширения"
METHOD_ADMIN_RADIO = "Пакет на %s"
METHOD_EXTRACTION_RADIO = "Извличане с %s"
METHOD_HEADER = "Извличане на %s"
METHOD_MSI_NOTE_LABEL = "Забележка:"
METHOD_MSI_REQUIRES_LABEL = "Необходим е msi2xml"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Метод на извличане"
METHOD_SWITCH_RADIO = "%s комутатор"
METHOD_NOTIS_RADIO = "Не е InstallShield пакет"
METHOD_TEXT_LABEL = "%s поддържа следните методи за извличане на %s. За съжаление, нито един от тези методи не е надежден на 100 %. Ако зададения по подразбиране метод, не работи, моля изберете алтернативен метод. "
METHOD_UNPACKER_RADIO = "Разпакетиране с %s"

; GUI control functions
DOES_NOT_EXIST = "не съществува.%n"
EXTRACT_TO = "Извличане в"
INVALID_DIR_SELECTED =  "%s е невалидна папка."
INVALID_FILE_SELECTED = "%sМоля, изберете правилния файл."
OPEN_FILE = "Отваряне на файл"
SELECT_FILE = "Избор на Файл"
WRITE_TO = "Запис в"

; Common terms
TERM_ARCHIVE = "архив"
TERM_COMPRESSED = "компресиран файл"
TERM_DISK = "диск"
TERM_EBOOK = "електр. книга"
TERM_ECARD = "електр. карта"
TERM_ENCODED = "кодиран файл"
TERM_EXECUTABLE = "изпълним файл"
TERM_FAILED = "неуспешно"
TERM_HELP = "Помощен файл"
TERM_HOTFIX = "поправка"
TERM_IMAGE = "изображение"
TERM_INSTALLER = ""
TERM_PACKAGE = "пакет"
TERM_PATCH = "кръпка"
TERM_SFX = "Самоизвличащ се"
TERM_STAGE = "Етап"
TERM_SUCCEEDED = "успешно"
TERM_TESTING = "Изпробване на"
TERM_UNKNOWN = "неизвестно"
TERM_UNPACKED = "разпакетиран"
TERM_UPDATER = "обновяване"

; Status messages
SCANNING_FILE = "Определяне типа на файла."
SCANNING_EXE = "Сканиране на файла (%s)"
EXTRACTING = "Извличане на файловете от:"
INIT_WAIT = "Инициализиране на програмата.%nМоля изчакайте."

; Custom prompts
CONVERT_CDROM = "%s CD-ROM изображения не могат да бъдат извлечени директно.  Вместо това, изображението %nще бъде преобразувано в ISO CD-ROM изображение, което да бъде извлечено.%n%nЖелаете ли да продължите?%nЗабележка: Този процес отнема няколко минути."
CONVERT_CDROM_STAGE1_FAILED = "Грешка: BIN/CUE изображението не е преобразувано.%nПрегледайте дали CUE файла е правилно форматиран."
CONVERT_CDROM_STAGE2_FAILED = "Грешка: ISO изображението е създадено от BIN/CUE изображение, но то не може да бъде преобразувано.%nИскате ли да запазите ISO изображението за бъдещ анализ?"
CONVERT_BIN_MISSING = "Грешка: Не е открит:%n%s\%s.%s%n%nНеободими са и двата файла %s.bin и %s.cue."
INIT_COMPLETE = "Инициализиране на %s.  Затворете пакета и после натиснете "ОК", за да продължите."
WISE_MSI_PROMPT = "Внимание: Този метод работи само с определени Wise пакети за Windows Installer.%nАко се стартира Съветника за инсталиране на Wise и изчаква въвеждане, този файл - не%nсе поддържа.  Затворете пакета, и %s ще прекрати извличането.%n%nЖелаете ли да продължите?"
UNPACK_PROMPT = "Този файл е пакетиран с %s, но може да бъде извлечен.%nТова може да е защото типа файл не се поддържа или защото%nняма включенни файлове, които да бъдат извлечени.%n%nИскате ли да разпакетирате този файл?%n%nЗабележка: Разпакетирания файл е с име:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Грешка: %s%nне е разпакетиран"
WARN_EXECUTE = "Внимание:  За да извлечете файлове от този тип, файлът трябва да се изпълни директно.%nАко продължите, ще бъде изпълнена следната команда:%n%n%s%n%nАко смятате, че този файл може да е вредоносен, препоръчително е да не продължавате.%nИскате ли да продължите извличането?"

; Help text
HELP_SUMMARY = "Извличане от всякакви архиви или инсталационни пакети."
HELP_SYNTAX = "%nПриложение:  %s [/help] [filename [destination]]"
HELP_ARGUMENTS = "%n%nПоддържани аргументи:"
HELP_HELP = "%n     /help%t%tПомощна информация"
HELP_FILENAME = "%n     filename%tИме на файла, който да бъде извлечен"
HELP_DESTINATION = "%n     destination%tПапка, в която да бъде извлечен"
HELP_SUB = "%n%nДобавянето на /sub вместо име на изходна папка %n%s ще доведе до извличане в подпапка с име на арива."
HELP_EXAMPLE1 = "%n%nНапример:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nИзпълнението на %s без аргументи ще доведе до%nзапитване за избор на изходна папка и име на файла."

; Error messages
CANNOT_LOG = "Извличането на %s не е отчетено."
CANNOT_DEBUG = "Изходната папка за записване на файла с грешки, "%s", е недостъпна.%nВместо това ще бъде използвана вашата временна папка."
CANNOT_EXTRACT = "%s не може да бъде извлечен.%nФайла е от тип: %s%n%nНатиснете "OK", ако искате да анализирате файла, или "Отказ" за изход."
UNKNOWN_EXT = "%s%nима неизвестно разширение и не може да бъде извлечен."
INVALID_DIR = "%s%nне е създаден. Изберете валидна папка."
EXTRACT_FAILED = "%s не е извлечен.%nТова е %s, който се поддържа, но не е извлечен.%nМоля, прегледайте отчета, %s, за повече информация.%n%nНатиснете "OK", за преглед на отчета, или "Отказ" за изход."

[Installer]
; Components page
COMP_DOCS = "Документация и лицензна информация"
COMP_LANG = "Файлове за многоезична поддръжка"
COMP_ACE = "Поддръжка за ACE файлове"
COMP_KGB = "Поддръжка за KGB файлове"
COMP_PEA = "Поддръжка за Pea файлове"
COMP_SIT = "Поддръжка за StuffIt файлове"

; Preferences page
PREFS_CAPTION = "Настройки на програмата"
PREFS_DESCRIPTION = "Какви настройки за Universal Extractor предпочитате?"
PREFS_LABEL1 = "Можете да инсталирате Universal Extractor с настройки по подразбиране."
PREFS_LABEL2 = "Тези настройки могат да бъдат променени след завършване на инсталирането, във файла UniExtract.ini."
LANGUAGE_LABEL = "Предпочитан език"
DEBUG_LABEL = "Папка за извличане"
APPEND_EXT_LABEL = "&Добавяй разширения на файловете"
HISTORY_LABEL = "Записвай &хронология"
REMOVE_DUPE_LABEL = "Изтривай &дублираните файлове"
REMOVE_TEMP_LABEL = "Изтривай &временните файлове"
WARN_EXECUTE_LABEL = "&Питай преди изпълняване на файлове"

; Tasks page
ASSOCIATE = "&Интегриране в контекстното меню на Explorer"
ASSOCIATE_FILES = "Добави "Извлечи &файловете с UniExtract" в контекстното меню"
ASSOCIATE_HERE = "Добави "Извлечи файловете &с UniExtract тук" в контекстното меню"
ASSOCIATE_SUBDIR = "Добави "Извлечи файловете с UniExtract в &подпапка" в контекстното меню"
ASSOCIATE_FORCE = "Принудително &асоциране с всички подържани формати архиви"
MODIFY_PATH = "Добави Universal Extractor към системния &път"
DESKTOP_ICON = "Създай икона на &Работния плот"
QUICK_LAUNCH_ICON = "Създай икона в лентата "&Бързо стартиране""
SENDTO_ICON = "Създай икона в менюто "Изпрати &до""

; Context Menu integration
EXTRACT_FILES = "Извлечи &файловете с UniExtract"
EXTRACT_HERE = "Извлечи файловете &с UniExtract тук"
EXTRACT_SUB = "Извлечи файловете с UniExtract в &подпапка"
